Repository: gurius/intervalify
Catalog: src/locale/messages.*.xlf
Languages: uk

source: add preset
uk: Додати тренування

# addPresetDesc
source: Create new preset
uk: Створити нове тренування

source: Presets list
uk: Список тренуваннь

# presetsListDesc
source: Go to presets list page
uk: Перейти на сторінку зі списком тренуваннь

# ActDefPres
source: Activate default preset
uk: Активувати тренування за замовчуванням

# ActDefPresDesc
source: Go to page with default preset preloaded
uk: Перейти до сторінки запуску тренування

# home.btn.title.menu
source: menu
uk: меню

source: {VAR_SELECT, select, new {New} edit {Editing} }
uk: {VAR_SELECT, select, new {Нова} edit {Редагування} }

# exerciseEditor.input.placeholder.exerciseTitle
source: exercise title
uk: назва вправи

# exerciseEditor.icon.title.exercise.reps
source: repetitions of the exercise
uk: повторення вправи

# exerciseEditor.input.placeholder.reps
source: repetitions of the exercise
uk: повторення вправи

# exerciseEditor.icon.title.presetReps
source: general cycle
uk: загальний цикл

# exerciseEditor.icon.title.playAtStart
source: execute at the start(excluding from general cycle)
uk: виконувати спочатку(виключаючи із загального циклу)

# exerciseEditor.icon.title.playAtEnd
source: execute at the end(excluding from general cycle)
uk: виконувати у кінці(виключаючи із загального циклу)

# exerciseEditor.input.title.color
source: Choose color for exercise
uk: вибрати колір для стилізаціі вправи

# exerciseEditor.btn.title.removeTimer
source: remove timer
uk: видалити відлік

# exerciseEditor.btn.title.addTimer
source: add timer
uk: додати відлік

# exerciseEditor.btn.title.dialogDismiss
source: dismiss
uk: скасувати

# exerciseEditor.btn.title.dialogSave
source: save
uk: зберегти

# textCopy.input.link
source: Link
uk: Посилання

# textCopy.btn.copy
source: Copy
uk: Скопіювати

# deletionConfirmation.h3
source: Are you shure you want to remove this {object, select, preset {...} exercise {...}} - {{title}}?
uk: Ви впевнені, що хочете видалити {object, select, preset {...} exercise {...}} - {{title}}?

source: {VAR_SELECT, select, preset {preset } exercise {esercise } }
uk: {VAR_SELECT, select, preset {тренування } exercise {вправу } }

# deletionConfirmation.h4
source: After confirmation {object, select, preset {...} exercise {...}} cannot be recovered!
uk: Після підтвердження, {object, select, preset {...} exercise {...}} буде неможливо відновити!

# deletionConfirmation.btn.Iunderstand
source: Yes, remove!
uk: Так, видалити!

# deletionConfirmation.btn.cancel
source: cancel
uk: відмітити

# presetsEditor.input.placeholder.presetsTitle
source: presets title
uk: Назва тренування

# presetsEditor.title.editTitle
source: edit title
uk: Відредагувати назву

# presetsEditor.input.cycles
source: cycles
uk: цикли

# presetsEditor.icon.cycles
source: cycles
uk: цикли

# presetsEditor.icon.title.begining
source: Play in the begining
uk: Виконувати спочатку

# presetsEditor.icon.title.end
source: Play in the end
uk: Виконувати в кінці

# presetsEditor.icon.title.cycled
source: cycled exercise
uk: циклічна вправа

# presetEditor.icon.exercise.reps
source: exercise repetitions
uk: повторення вправи

# presetsEditor.icon.title.removeExercise
source: remove exercise
uk: видалити вправу

# presetsEditor.title.exercise
source: exercise
uk: вправа

# presetsEditor.btn.title.options
source: options
uk: опції

# presetsEditor.btn.title.close
source: close
uk: закрити

# presetsEditor.btn.title.addNewExercise
source: add new exercise
uk: додати нову вправу

# presetsEditor.btn.title.deletePreset
source: delete preset
uk: видалити тренування

# presetsEditor.btn.title.launchingPreset
source: launching preset
uk: перейти до тренування

# presetsEditor.btn.title.sharePreset
source: share the preset
uk: поділитися тренуванням

# countdown.btn.title.restWork
source: rest/work
uk: робити/відпочивати

# countdown.input.placeholder.minutes
source: minutes
uk: хвилин

# countdown.input.placeholder.seconds
source: seconds
uk: секунд

source: {VAR_SELECT, select, rest {rest} other {{{ stepper.currentStep.type === 'work' ? stepper.currentStep.title : stepper.currentStep.type }} } }
uk: {VAR_SELECT, select, rest {відпочинок} other {{{ stepper.currentStep.type === 'work' ? stepper.currentStep.title : stepper.currentStep.type }} } }

# stepper.current.exercise.title.exerciseInProgress
source: exercise in progress
uk: поточна вправа

# stepper.next.exercise.title.nextExercise
source: next exercise
uk: наступна вправа

source: {VAR_SELECT, select, rest {rest} other {{{ stepper.nextStep.type === 'work' ? stepper.nextStep.title : stepper.nextStep.type }} } }
uk: {VAR_SELECT, select, rest {відпочинок} other {{{ stepper.currentStep.type === 'work' ? stepper.currentStep.title : stepper.currentStep.type }} } }

# stepper.time.elapsed
source: time elapsed
uk: часу пройшло

# stepper.time.remaining
source: time remaining
uk: часу залишилось

# stepper.timers.elapsed
source: timers elapsed
uk: відліків відпрацьовано

# stepper.timers.remaining
source: timers remaining
uk: відліків залишилось

# stepper.btn.title.play
source: play
uk: продовжити

# stepper.btn.title.pause
source: pause
uk: призупинити

# stepper.btn.title.stop
source: stop
uk: зупинити

# stepper.btn.title.start
source: start
uk: розпочати

source: {VAR_SELECT, select, GO! {GO!} other {{{stage}}} }
uk: {VAR_SELECT, select, GO! {ВПЕРЕД!} other {{{stage}}} }

# stepper.stat.title.totalTime
source: total time of preset
uk: загальний час тренування

# stepper.stat.title.totalWorkTime
source: total work time
uk: Загальний час роботи

# stepper.stat.title.totalRestTime
source: total rest time
uk: загальний час відпочинку

# stepper.done.title
source: accomplished
uk: виконано

# stepper.btn.title.reset
source: reset
uk: До початку

source: preset
uk: тренування

source: launching preset
uk: перейти до тренування

source: edit preset
uk: відредагувати тренування

source: delete preset
uk: видалити тренування

source: {VAR_SELECT, select, rest {rest} work {work} }
uk: {VAR_SELECT, select, rest {відпочинок} work {робота} }

# export.btn.save
source: Save to 'Preset list'
uk: Зберегти у 'Список тренуваннь'
